// media/mojo/mojom/media_metrics_provider.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors. All rights reserved.
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef MEDIA_MOJO_MOJOM_MEDIA_METRICS_PROVIDER_MOJOM_PARAMS_DATA_H_
#define MEDIA_MOJO_MOJOM_MEDIA_METRICS_PROVIDER_MOJOM_PARAMS_DATA_H_

#include "base/logging.h"
#include "base/macros.h"
#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"
#include "mojo/public/cpp/bindings/lib/validation_context.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#elif defined(_MSC_VER)
#pragma warning(push)
#pragma warning(disable:4056)
#pragma warning(disable:4065)
#pragma warning(disable:4756)
#endif
namespace media {
namespace mojom {
namespace internal {
class  MediaMetricsProvider_Initialize_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(MediaMetricsProvider_Initialize_Params_Data));
      new (data()) MediaMetricsProvider_Initialize_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    MediaMetricsProvider_Initialize_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<MediaMetricsProvider_Initialize_Params_Data>(index_);
    }
    MediaMetricsProvider_Initialize_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t is_mse : 1;
  uint8_t pad0_[3];
  int32_t url_scheme;

 private:
  MediaMetricsProvider_Initialize_Params_Data();
  ~MediaMetricsProvider_Initialize_Params_Data() = delete;
};
static_assert(sizeof(MediaMetricsProvider_Initialize_Params_Data) == 16,
              "Bad sizeof(MediaMetricsProvider_Initialize_Params_Data)");
class  MediaMetricsProvider_OnError_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(MediaMetricsProvider_OnError_Params_Data));
      new (data()) MediaMetricsProvider_OnError_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    MediaMetricsProvider_OnError_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<MediaMetricsProvider_OnError_Params_Data>(index_);
    }
    MediaMetricsProvider_OnError_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t status;
  uint8_t padfinal_[4];

 private:
  MediaMetricsProvider_OnError_Params_Data();
  ~MediaMetricsProvider_OnError_Params_Data() = delete;
};
static_assert(sizeof(MediaMetricsProvider_OnError_Params_Data) == 16,
              "Bad sizeof(MediaMetricsProvider_OnError_Params_Data)");
class  MediaMetricsProvider_SetHasPlayed_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(MediaMetricsProvider_SetHasPlayed_Params_Data));
      new (data()) MediaMetricsProvider_SetHasPlayed_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    MediaMetricsProvider_SetHasPlayed_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<MediaMetricsProvider_SetHasPlayed_Params_Data>(index_);
    }
    MediaMetricsProvider_SetHasPlayed_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  MediaMetricsProvider_SetHasPlayed_Params_Data();
  ~MediaMetricsProvider_SetHasPlayed_Params_Data() = delete;
};
static_assert(sizeof(MediaMetricsProvider_SetHasPlayed_Params_Data) == 8,
              "Bad sizeof(MediaMetricsProvider_SetHasPlayed_Params_Data)");
class  MediaMetricsProvider_SetHaveEnough_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(MediaMetricsProvider_SetHaveEnough_Params_Data));
      new (data()) MediaMetricsProvider_SetHaveEnough_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    MediaMetricsProvider_SetHaveEnough_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<MediaMetricsProvider_SetHaveEnough_Params_Data>(index_);
    }
    MediaMetricsProvider_SetHaveEnough_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  MediaMetricsProvider_SetHaveEnough_Params_Data();
  ~MediaMetricsProvider_SetHaveEnough_Params_Data() = delete;
};
static_assert(sizeof(MediaMetricsProvider_SetHaveEnough_Params_Data) == 8,
              "Bad sizeof(MediaMetricsProvider_SetHaveEnough_Params_Data)");
class  MediaMetricsProvider_SetIsEME_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(MediaMetricsProvider_SetIsEME_Params_Data));
      new (data()) MediaMetricsProvider_SetIsEME_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    MediaMetricsProvider_SetIsEME_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<MediaMetricsProvider_SetIsEME_Params_Data>(index_);
    }
    MediaMetricsProvider_SetIsEME_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  MediaMetricsProvider_SetIsEME_Params_Data();
  ~MediaMetricsProvider_SetIsEME_Params_Data() = delete;
};
static_assert(sizeof(MediaMetricsProvider_SetIsEME_Params_Data) == 8,
              "Bad sizeof(MediaMetricsProvider_SetIsEME_Params_Data)");
class  MediaMetricsProvider_SetTimeToMetadata_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(MediaMetricsProvider_SetTimeToMetadata_Params_Data));
      new (data()) MediaMetricsProvider_SetTimeToMetadata_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    MediaMetricsProvider_SetTimeToMetadata_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<MediaMetricsProvider_SetTimeToMetadata_Params_Data>(index_);
    }
    MediaMetricsProvider_SetTimeToMetadata_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::mojo_base::mojom::internal::TimeDelta_Data> elapsed;

 private:
  MediaMetricsProvider_SetTimeToMetadata_Params_Data();
  ~MediaMetricsProvider_SetTimeToMetadata_Params_Data() = delete;
};
static_assert(sizeof(MediaMetricsProvider_SetTimeToMetadata_Params_Data) == 16,
              "Bad sizeof(MediaMetricsProvider_SetTimeToMetadata_Params_Data)");
class  MediaMetricsProvider_SetTimeToFirstFrame_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(MediaMetricsProvider_SetTimeToFirstFrame_Params_Data));
      new (data()) MediaMetricsProvider_SetTimeToFirstFrame_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    MediaMetricsProvider_SetTimeToFirstFrame_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<MediaMetricsProvider_SetTimeToFirstFrame_Params_Data>(index_);
    }
    MediaMetricsProvider_SetTimeToFirstFrame_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::mojo_base::mojom::internal::TimeDelta_Data> elapsed;

 private:
  MediaMetricsProvider_SetTimeToFirstFrame_Params_Data();
  ~MediaMetricsProvider_SetTimeToFirstFrame_Params_Data() = delete;
};
static_assert(sizeof(MediaMetricsProvider_SetTimeToFirstFrame_Params_Data) == 16,
              "Bad sizeof(MediaMetricsProvider_SetTimeToFirstFrame_Params_Data)");
class  MediaMetricsProvider_SetTimeToPlayReady_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(MediaMetricsProvider_SetTimeToPlayReady_Params_Data));
      new (data()) MediaMetricsProvider_SetTimeToPlayReady_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    MediaMetricsProvider_SetTimeToPlayReady_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<MediaMetricsProvider_SetTimeToPlayReady_Params_Data>(index_);
    }
    MediaMetricsProvider_SetTimeToPlayReady_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::mojo_base::mojom::internal::TimeDelta_Data> elapsed;

 private:
  MediaMetricsProvider_SetTimeToPlayReady_Params_Data();
  ~MediaMetricsProvider_SetTimeToPlayReady_Params_Data() = delete;
};
static_assert(sizeof(MediaMetricsProvider_SetTimeToPlayReady_Params_Data) == 16,
              "Bad sizeof(MediaMetricsProvider_SetTimeToPlayReady_Params_Data)");
class  MediaMetricsProvider_SetContainerName_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(MediaMetricsProvider_SetContainerName_Params_Data));
      new (data()) MediaMetricsProvider_SetContainerName_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    MediaMetricsProvider_SetContainerName_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<MediaMetricsProvider_SetContainerName_Params_Data>(index_);
    }
    MediaMetricsProvider_SetContainerName_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t container_name;
  uint8_t padfinal_[4];

 private:
  MediaMetricsProvider_SetContainerName_Params_Data();
  ~MediaMetricsProvider_SetContainerName_Params_Data() = delete;
};
static_assert(sizeof(MediaMetricsProvider_SetContainerName_Params_Data) == 16,
              "Bad sizeof(MediaMetricsProvider_SetContainerName_Params_Data)");
class  MediaMetricsProvider_AcquireWatchTimeRecorder_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(MediaMetricsProvider_AcquireWatchTimeRecorder_Params_Data));
      new (data()) MediaMetricsProvider_AcquireWatchTimeRecorder_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    MediaMetricsProvider_AcquireWatchTimeRecorder_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<MediaMetricsProvider_AcquireWatchTimeRecorder_Params_Data>(index_);
    }
    MediaMetricsProvider_AcquireWatchTimeRecorder_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::media::mojom::internal::PlaybackProperties_Data> properties;
  mojo::internal::Handle_Data recorder;
  uint8_t padfinal_[4];

 private:
  MediaMetricsProvider_AcquireWatchTimeRecorder_Params_Data();
  ~MediaMetricsProvider_AcquireWatchTimeRecorder_Params_Data() = delete;
};
static_assert(sizeof(MediaMetricsProvider_AcquireWatchTimeRecorder_Params_Data) == 24,
              "Bad sizeof(MediaMetricsProvider_AcquireWatchTimeRecorder_Params_Data)");
class  MediaMetricsProvider_AcquireVideoDecodeStatsRecorder_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(MediaMetricsProvider_AcquireVideoDecodeStatsRecorder_Params_Data));
      new (data()) MediaMetricsProvider_AcquireVideoDecodeStatsRecorder_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    MediaMetricsProvider_AcquireVideoDecodeStatsRecorder_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<MediaMetricsProvider_AcquireVideoDecodeStatsRecorder_Params_Data>(index_);
    }
    MediaMetricsProvider_AcquireVideoDecodeStatsRecorder_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Handle_Data recorder;
  uint8_t padfinal_[4];

 private:
  MediaMetricsProvider_AcquireVideoDecodeStatsRecorder_Params_Data();
  ~MediaMetricsProvider_AcquireVideoDecodeStatsRecorder_Params_Data() = delete;
};
static_assert(sizeof(MediaMetricsProvider_AcquireVideoDecodeStatsRecorder_Params_Data) == 16,
              "Bad sizeof(MediaMetricsProvider_AcquireVideoDecodeStatsRecorder_Params_Data)");
class  MediaMetricsProvider_AcquireLearningTaskController_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(MediaMetricsProvider_AcquireLearningTaskController_Params_Data));
      new (data()) MediaMetricsProvider_AcquireLearningTaskController_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    MediaMetricsProvider_AcquireLearningTaskController_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<MediaMetricsProvider_AcquireLearningTaskController_Params_Data>(index_);
    }
    MediaMetricsProvider_AcquireLearningTaskController_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::String_Data> taskName;
  mojo::internal::Handle_Data controller;
  uint8_t padfinal_[4];

 private:
  MediaMetricsProvider_AcquireLearningTaskController_Params_Data();
  ~MediaMetricsProvider_AcquireLearningTaskController_Params_Data() = delete;
};
static_assert(sizeof(MediaMetricsProvider_AcquireLearningTaskController_Params_Data) == 24,
              "Bad sizeof(MediaMetricsProvider_AcquireLearningTaskController_Params_Data)");
class  MediaMetricsProvider_SetHasAudio_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(MediaMetricsProvider_SetHasAudio_Params_Data));
      new (data()) MediaMetricsProvider_SetHasAudio_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    MediaMetricsProvider_SetHasAudio_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<MediaMetricsProvider_SetHasAudio_Params_Data>(index_);
    }
    MediaMetricsProvider_SetHasAudio_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t codec;
  uint8_t padfinal_[4];

 private:
  MediaMetricsProvider_SetHasAudio_Params_Data();
  ~MediaMetricsProvider_SetHasAudio_Params_Data() = delete;
};
static_assert(sizeof(MediaMetricsProvider_SetHasAudio_Params_Data) == 16,
              "Bad sizeof(MediaMetricsProvider_SetHasAudio_Params_Data)");
class  MediaMetricsProvider_SetHasVideo_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(MediaMetricsProvider_SetHasVideo_Params_Data));
      new (data()) MediaMetricsProvider_SetHasVideo_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    MediaMetricsProvider_SetHasVideo_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<MediaMetricsProvider_SetHasVideo_Params_Data>(index_);
    }
    MediaMetricsProvider_SetHasVideo_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t codec;
  uint8_t padfinal_[4];

 private:
  MediaMetricsProvider_SetHasVideo_Params_Data();
  ~MediaMetricsProvider_SetHasVideo_Params_Data() = delete;
};
static_assert(sizeof(MediaMetricsProvider_SetHasVideo_Params_Data) == 16,
              "Bad sizeof(MediaMetricsProvider_SetHasVideo_Params_Data)");
class  MediaMetricsProvider_SetVideoPipelineInfo_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(MediaMetricsProvider_SetVideoPipelineInfo_Params_Data));
      new (data()) MediaMetricsProvider_SetVideoPipelineInfo_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    MediaMetricsProvider_SetVideoPipelineInfo_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<MediaMetricsProvider_SetVideoPipelineInfo_Params_Data>(index_);
    }
    MediaMetricsProvider_SetVideoPipelineInfo_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::media::mojom::internal::PipelineDecoderInfo_Data> info;

 private:
  MediaMetricsProvider_SetVideoPipelineInfo_Params_Data();
  ~MediaMetricsProvider_SetVideoPipelineInfo_Params_Data() = delete;
};
static_assert(sizeof(MediaMetricsProvider_SetVideoPipelineInfo_Params_Data) == 16,
              "Bad sizeof(MediaMetricsProvider_SetVideoPipelineInfo_Params_Data)");
class  MediaMetricsProvider_SetAudioPipelineInfo_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(MediaMetricsProvider_SetAudioPipelineInfo_Params_Data));
      new (data()) MediaMetricsProvider_SetAudioPipelineInfo_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    MediaMetricsProvider_SetAudioPipelineInfo_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<MediaMetricsProvider_SetAudioPipelineInfo_Params_Data>(index_);
    }
    MediaMetricsProvider_SetAudioPipelineInfo_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::media::mojom::internal::PipelineDecoderInfo_Data> info;

 private:
  MediaMetricsProvider_SetAudioPipelineInfo_Params_Data();
  ~MediaMetricsProvider_SetAudioPipelineInfo_Params_Data() = delete;
};
static_assert(sizeof(MediaMetricsProvider_SetAudioPipelineInfo_Params_Data) == 16,
              "Bad sizeof(MediaMetricsProvider_SetAudioPipelineInfo_Params_Data)");

}  // namespace internal
class MediaMetricsProvider_Initialize_ParamsDataView {
 public:
  MediaMetricsProvider_Initialize_ParamsDataView() {}

  MediaMetricsProvider_Initialize_ParamsDataView(
      internal::MediaMetricsProvider_Initialize_Params_Data* data,
      mojo::internal::SerializationContext* context)
      : data_(data) {}

  bool is_null() const { return !data_; }
  bool is_mse() const {
    return data_->is_mse;
  }
  template <typename UserType>
  WARN_UNUSED_RESULT bool ReadUrlScheme(UserType* output) const {
    auto data_value = data_->url_scheme;
    return mojo::internal::Deserialize<::media::mojom::MediaURLScheme>(
        data_value, output);
  }

  MediaURLScheme url_scheme() const {
    return static_cast<MediaURLScheme>(data_->url_scheme);
  }
 private:
