// services/viz/privileged/mojom/compositing/frame_sink_manager.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors. All rights reserved.
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef SERVICES_VIZ_PRIVILEGED_MOJOM_COMPOSITING_FRAME_SINK_MANAGER_MOJOM_PARAMS_DATA_H_
#define SERVICES_VIZ_PRIVILEGED_MOJOM_COMPOSITING_FRAME_SINK_MANAGER_MOJOM_PARAMS_DATA_H_

#include "base/logging.h"
#include "base/macros.h"
#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"
#include "mojo/public/cpp/bindings/lib/validation_context.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#elif defined(_MSC_VER)
#pragma warning(push)
#pragma warning(disable:4056)
#pragma warning(disable:4065)
#pragma warning(disable:4756)
#endif
namespace viz {
namespace mojom {
namespace internal {
class  FrameSinkManager_RegisterFrameSinkId_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(FrameSinkManager_RegisterFrameSinkId_Params_Data));
      new (data()) FrameSinkManager_RegisterFrameSinkId_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    FrameSinkManager_RegisterFrameSinkId_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<FrameSinkManager_RegisterFrameSinkId_Params_Data>(index_);
    }
    FrameSinkManager_RegisterFrameSinkId_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::viz::mojom::internal::FrameSinkId_Data> frame_sink_id;
  uint8_t report_activation : 1;
  uint8_t padfinal_[7];

 private:
  FrameSinkManager_RegisterFrameSinkId_Params_Data();
  ~FrameSinkManager_RegisterFrameSinkId_Params_Data() = delete;
};
static_assert(sizeof(FrameSinkManager_RegisterFrameSinkId_Params_Data) == 24,
              "Bad sizeof(FrameSinkManager_RegisterFrameSinkId_Params_Data)");
class  FrameSinkManager_InvalidateFrameSinkId_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(FrameSinkManager_InvalidateFrameSinkId_Params_Data));
      new (data()) FrameSinkManager_InvalidateFrameSinkId_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    FrameSinkManager_InvalidateFrameSinkId_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<FrameSinkManager_InvalidateFrameSinkId_Params_Data>(index_);
    }
    FrameSinkManager_InvalidateFrameSinkId_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::viz::mojom::internal::FrameSinkId_Data> frame_sink_id;

 private:
  FrameSinkManager_InvalidateFrameSinkId_Params_Data();
  ~FrameSinkManager_InvalidateFrameSinkId_Params_Data() = delete;
};
static_assert(sizeof(FrameSinkManager_InvalidateFrameSinkId_Params_Data) == 16,
              "Bad sizeof(FrameSinkManager_InvalidateFrameSinkId_Params_Data)");
class  FrameSinkManager_EnableSynchronizationReporting_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(FrameSinkManager_EnableSynchronizationReporting_Params_Data));
      new (data()) FrameSinkManager_EnableSynchronizationReporting_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    FrameSinkManager_EnableSynchronizationReporting_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<FrameSinkManager_EnableSynchronizationReporting_Params_Data>(index_);
    }
    FrameSinkManager_EnableSynchronizationReporting_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::viz::mojom::internal::FrameSinkId_Data> frame_sink_id;
  mojo::internal::Pointer<mojo::internal::String_Data> reporting_label;

 private:
  FrameSinkManager_EnableSynchronizationReporting_Params_Data();
  ~FrameSinkManager_EnableSynchronizationReporting_Params_Data() = delete;
};
static_assert(sizeof(FrameSinkManager_EnableSynchronizationReporting_Params_Data) == 24,
              "Bad sizeof(FrameSinkManager_EnableSynchronizationReporting_Params_Data)");
class  FrameSinkManager_SetFrameSinkDebugLabel_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(FrameSinkManager_SetFrameSinkDebugLabel_Params_Data));
      new (data()) FrameSinkManager_SetFrameSinkDebugLabel_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    FrameSinkManager_SetFrameSinkDebugLabel_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<FrameSinkManager_SetFrameSinkDebugLabel_Params_Data>(index_);
    }
    FrameSinkManager_SetFrameSinkDebugLabel_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::viz::mojom::internal::FrameSinkId_Data> frame_sink_id;
  mojo::internal::Pointer<mojo::internal::String_Data> debug_label;

 private:
  FrameSinkManager_SetFrameSinkDebugLabel_Params_Data();
  ~FrameSinkManager_SetFrameSinkDebugLabel_Params_Data() = delete;
};
static_assert(sizeof(FrameSinkManager_SetFrameSinkDebugLabel_Params_Data) == 24,
              "Bad sizeof(FrameSinkManager_SetFrameSinkDebugLabel_Params_Data)");
class  FrameSinkManager_CreateRootCompositorFrameSink_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(FrameSinkManager_CreateRootCompositorFrameSink_Params_Data));
      new (data()) FrameSinkManager_CreateRootCompositorFrameSink_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    FrameSinkManager_CreateRootCompositorFrameSink_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<FrameSinkManager_CreateRootCompositorFrameSink_Params_Data>(index_);
    }
    FrameSinkManager_CreateRootCompositorFrameSink_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::RootCompositorFrameSinkParams_Data> params;

 private:
  FrameSinkManager_CreateRootCompositorFrameSink_Params_Data();
  ~FrameSinkManager_CreateRootCompositorFrameSink_Params_Data() = delete;
};
static_assert(sizeof(FrameSinkManager_CreateRootCompositorFrameSink_Params_Data) == 16,
              "Bad sizeof(FrameSinkManager_CreateRootCompositorFrameSink_Params_Data)");
class  FrameSinkManager_CreateCompositorFrameSink_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(FrameSinkManager_CreateCompositorFrameSink_Params_Data));
      new (data()) FrameSinkManager_CreateCompositorFrameSink_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    FrameSinkManager_CreateCompositorFrameSink_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<FrameSinkManager_CreateCompositorFrameSink_Params_Data>(index_);
    }
    FrameSinkManager_CreateCompositorFrameSink_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::viz::mojom::internal::FrameSinkId_Data> frame_sink_id;
  mojo::internal::Handle_Data compositor_frame_sink;
  mojo::internal::Interface_Data compositor_frame_sink_client;
  uint8_t padfinal_[4];

 private:
  FrameSinkManager_CreateCompositorFrameSink_Params_Data();
  ~FrameSinkManager_CreateCompositorFrameSink_Params_Data() = delete;
};
static_assert(sizeof(FrameSinkManager_CreateCompositorFrameSink_Params_Data) == 32,
              "Bad sizeof(FrameSinkManager_CreateCompositorFrameSink_Params_Data)");
class  FrameSinkManager_DestroyCompositorFrameSink_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(FrameSinkManager_DestroyCompositorFrameSink_Params_Data));
      new (data()) FrameSinkManager_DestroyCompositorFrameSink_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    FrameSinkManager_DestroyCompositorFrameSink_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<FrameSinkManager_DestroyCompositorFrameSink_Params_Data>(index_);
    }
    FrameSinkManager_DestroyCompositorFrameSink_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::viz::mojom::internal::FrameSinkId_Data> frame_sink_id;

 private:
  FrameSinkManager_DestroyCompositorFrameSink_Params_Data();
  ~FrameSinkManager_DestroyCompositorFrameSink_Params_Data() = delete;
};
static_assert(sizeof(FrameSinkManager_DestroyCompositorFrameSink_Params_Data) == 16,
              "Bad sizeof(FrameSinkManager_DestroyCompositorFrameSink_Params_Data)");
class  FrameSinkManager_DestroyCompositorFrameSink_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(FrameSinkManager_DestroyCompositorFrameSink_ResponseParams_Data));
      new (data()) FrameSinkManager_DestroyCompositorFrameSink_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    FrameSinkManager_DestroyCompositorFrameSink_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<FrameSinkManager_DestroyCompositorFrameSink_ResponseParams_Data>(index_);
    }
    FrameSinkManager_DestroyCompositorFrameSink_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  FrameSinkManager_DestroyCompositorFrameSink_ResponseParams_Data();
  ~FrameSinkManager_DestroyCompositorFrameSink_ResponseParams_Data() = delete;
};
static_assert(sizeof(FrameSinkManager_DestroyCompositorFrameSink_ResponseParams_Data) == 8,
              "Bad sizeof(FrameSinkManager_DestroyCompositorFrameSink_ResponseParams_Data)");
class  FrameSinkManager_RegisterFrameSinkHierarchy_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(FrameSinkManager_RegisterFrameSinkHierarchy_Params_Data));
      new (data()) FrameSinkManager_RegisterFrameSinkHierarchy_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    FrameSinkManager_RegisterFrameSinkHierarchy_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<FrameSinkManager_RegisterFrameSinkHierarchy_Params_Data>(index_);
    }
    FrameSinkManager_RegisterFrameSinkHierarchy_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::viz::mojom::internal::FrameSinkId_Data> parent_frame_sink_id;
  mojo::internal::Pointer<::viz::mojom::internal::FrameSinkId_Data> child_frame_sink_id;

 private:
  FrameSinkManager_RegisterFrameSinkHierarchy_Params_Data();
  ~FrameSinkManager_RegisterFrameSinkHierarchy_Params_Data() = delete;
};
static_assert(sizeof(FrameSinkManager_RegisterFrameSinkHierarchy_Params_Data) == 24,
              "Bad sizeof(FrameSinkManager_RegisterFrameSinkHierarchy_Params_Data)");
class  FrameSinkManager_UnregisterFrameSinkHierarchy_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(FrameSinkManager_UnregisterFrameSinkHierarchy_Params_Data));
      new (data()) FrameSinkManager_UnregisterFrameSinkHierarchy_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    FrameSinkManager_UnregisterFrameSinkHierarchy_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<FrameSinkManager_UnregisterFrameSinkHierarchy_Params_Data>(index_);
    }
    FrameSinkManager_UnregisterFrameSinkHierarchy_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::viz::mojom::internal::FrameSinkId_Data> parent_frame_sink_id;
  mojo::internal::Pointer<::viz::mojom::internal::FrameSinkId_Data> child_frame_sink_id;

 private:
  FrameSinkManager_UnregisterFrameSinkHierarchy_Params_Data();
  ~FrameSinkManager_UnregisterFrameSinkHierarchy_Params_Data() = delete;
};
static_assert(sizeof(FrameSinkManager_UnregisterFrameSinkHierarchy_Params_Data) == 24,
              "Bad sizeof(FrameSinkManager_UnregisterFrameSinkHierarchy_Params_Data)");
class  FrameSinkManager_AddVideoDetectorObserver_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(FrameSinkManager_AddVideoDetectorObserver_Params_Data));
      new (data()) FrameSinkManager_AddVideoDetectorObserver_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    FrameSinkManager_AddVideoDetectorObserver_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<FrameSinkManager_AddVideoDetectorObserver_Params_Data>(index_);
    }
    FrameSinkManager_AddVideoDetectorObserver_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Interface_Data observer;

 private:
  FrameSinkManager_AddVideoDetectorObserver_Params_Data();
  ~FrameSinkManager_AddVideoDetectorObserver_Params_Data() = delete;
};
static_assert(sizeof(FrameSinkManager_AddVideoDetectorObserver_Params_Data) == 16,
              "Bad sizeof(FrameSinkManager_AddVideoDetectorObserver_Params_Data)");
class  FrameSinkManager_CreateVideoCapturer_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(FrameSinkManager_CreateVideoCapturer_Params_Data));
      new (data()) FrameSinkManager_CreateVideoCapturer_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    FrameSinkManager_CreateVideoCapturer_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<FrameSinkManager_CreateVideoCapturer_Params_Data>(index_);
    }
    FrameSinkManager_CreateVideoCapturer_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Handle_Data receiver;
  uint8_t padfinal_[4];

 private:
  FrameSinkManager_CreateVideoCapturer_Params_Data();
  ~FrameSinkManager_CreateVideoCapturer_Params_Data() = delete;
};
static_assert(sizeof(FrameSinkManager_CreateVideoCapturer_Params_Data) == 16,
              "Bad sizeof(FrameSinkManager_CreateVideoCapturer_Params_Data)");
class  FrameSinkManager_EvictSurfaces_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(FrameSinkManager_EvictSurfaces_Params_Data));
      new (data()) FrameSinkManager_EvictSurfaces_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    FrameSinkManager_EvictSurfaces_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<FrameSinkManager_EvictSurfaces_Params_Data>(index_);
    }
    FrameSinkManager_EvictSurfaces_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::viz::mojom::internal::SurfaceId_Data>>> surface_ids;

 private:
  FrameSinkManager_EvictSurfaces_Params_Data();
  ~FrameSinkManager_EvictSurfaces_Params_Data() = delete;
};
static_assert(sizeof(FrameSinkManager_EvictSurfaces_Params_Data) == 16,
              "Bad sizeof(FrameSinkManager_EvictSurfaces_Params_Data)");
class  FrameSinkManager_RequestCopyOfOutput_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(FrameSinkManager_RequestCopyOfOutput_Params_Data));
      new (data()) FrameSinkManager_RequestCopyOfOutput_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    FrameSinkManager_RequestCopyOfOutput_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<FrameSinkManager_RequestCopyOfOutput_Params_Data>(index_);
    }
    FrameSinkManager_RequestCopyOfOutput_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::viz::mojom::internal::SurfaceId_Data> surface_id;
  mojo::internal::Pointer<::viz::mojom::internal::CopyOutputRequest_Data> request;

 private:
  FrameSinkManager_RequestCopyOfOutput_Params_Data();
  ~FrameSinkManager_RequestCopyOfOutput_Params_Data() = delete;
};
static_assert(sizeof(FrameSinkManager_RequestCopyOfOutput_Params_Data) == 24,
              "Bad sizeof(FrameSinkManager_RequestCopyOfOutput_Params_Data)");
class  FrameSinkManager_SetHitTestAsyncQueriedDebugRegions_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(FrameSinkManager_SetHitTestAsyncQueriedDebugRegions_Params_Data));
      new (data()) FrameSinkManager_SetHitTestAsyncQueriedDebugRegions_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    FrameSinkManager_SetHitTestAsyncQueriedDebugRegions_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<FrameSinkManager_SetHitTestAsyncQueriedDebugRegions_Params_Data>(index_);
    }
    FrameSinkManager_SetHitTestAsyncQueriedDebugRegions_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::viz::mojom::internal::FrameSinkId_Data> root_frame_sink_id;
  mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::viz::mojom::internal::FrameSinkId_Data>>> hit_test_async_queried_debug_queue;

 private:
  FrameSinkManager_SetHitTestAsyncQueriedDebugRegions_Params_Data();
  ~FrameSinkManager_SetHitTestAsyncQueriedDebugRegions_Params_Data() = delete;
};
static_assert(sizeof(FrameSinkManager_SetHitTestAsyncQueriedDebugRegions_Params_Data) == 24,
              "Bad sizeof(FrameSinkManager_SetHitTestAsyncQueriedDebugRegions_Params_Data)");
class  FrameSinkManager_CacheBackBuffer_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(FrameSinkManager_CacheBackBuffer_Params_Data));
      new (data()) FrameSinkManager_CacheBackBuffer_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    FrameSinkManager_CacheBackBuffer_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<FrameSinkManager_CacheBackBuffer_Params_Data>(index_);
    }
    FrameSinkManager_CacheBackBuffer_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint32_t cache_id;
  uint8_t pad0_[4];
  mojo::internal::Pointer<::viz::mojom::internal::FrameSinkId_Data> root_frame_sink_id;

 private:
  FrameSinkManager_CacheBackBuffer_Params_Data();
  ~FrameSinkManager_CacheBackBuffer_Params_Data() = delete;
};
static_assert(sizeof(FrameSinkManager_CacheBackBuffer_Params_Data) == 24,
              "Bad sizeof(FrameSinkManager_CacheBackBuffer_Params_Data)");
class  FrameSinkManager_EvictBackBuffer_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(FrameSinkManager_EvictBackBuffer_Params_Data));
      new (data()) FrameSinkManager_EvictBackBuffer_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    FrameSinkManager_EvictBackBuffer_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<FrameSinkManager_EvictBackBuffer_Params_Data>(index_);
    }
    FrameSinkManager_EvictBackBuffer_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint32_t cache_id;
  uint8_t padfinal_[4];

 private:
  FrameSinkManager_EvictBackBuffer_Params_Data();
  ~FrameSinkManager_EvictBackBuffer_Params_Data() = delete;
};
static_assert(sizeof(FrameSinkManager_EvictBackBuffer_Params_Data) == 16,
              "Bad sizeof(FrameSinkManager_EvictBackBuffer_Params_Data)");
class  FrameSinkManager_EvictBackBuffer_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(FrameSinkManager_EvictBackBuffer_ResponseParams_Data));
      new (data()) FrameSinkManager_EvictBackBuffer_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    FrameSinkManager_EvictBackBuffer_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<FrameSinkManager_EvictBackBuffer_ResponseParams_Data>(index_);
    }
    FrameSinkManager_EvictBackBuffer_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  FrameSinkManager_EvictBackBuffer_ResponseParams_Data();
  ~FrameSinkManager_EvictBackBuffer_ResponseParams_Data() = delete;
};
static_assert(sizeof(FrameSinkManager_EvictBackBuffer_ResponseParams_Data) == 8,
              "Bad sizeof(FrameSinkManager_EvictBackBuffer_ResponseParams_Data)");
class  FrameSinkManagerClient_OnFirstSurfaceActivation_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(FrameSinkManagerClient_OnFirstSurfaceActivation_Params_Data));
      new (data()) FrameSinkManagerClient_OnFirstSurfaceActivation_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    FrameSinkManagerClient_OnFirstSurfaceActivation_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<FrameSinkManagerClient_OnFirstSurfaceActivation_Params_Data>(index_);
    }
    FrameSinkManagerClient_OnFirstSurfaceActivation_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::viz::mojom::internal::SurfaceInfo_Data> surface_info;

 private:
  FrameSinkManagerClient_OnFirstSurfaceActivation_Params_Data();
  ~FrameSinkManagerClient_OnFirstSurfaceActivation_Params_Data() = delete;
};
static_assert(sizeof(FrameSinkManagerClient_OnFirstSurfaceActivation_Params_Data) == 16,
              "Bad sizeof(FrameSinkManagerClient_OnFirstSurfaceActivation_Params_Data)");
class  FrameSinkManagerClient_OnAggregatedHitTestRegionListUpdated_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(FrameSinkManagerClient_OnAggregatedHitTestRegionListUpdated_Params_Data));
      new (data()) FrameSinkManagerClient_OnAggregatedHitTestRegionListUpdated_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    FrameSinkManagerClient_OnAggregatedHitTestRegionListUpdated_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<FrameSinkManagerClient_OnAggregatedHitTestRegionListUpdated_Params_Data>(index_);
    }
    FrameSinkManagerClient_OnAggregatedHitTestRegionListUpdated_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::viz::mojom::internal::FrameSinkId_Data> frame_sink_id;
  mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::viz::mojom::internal::AggregatedHitTestRegion_Data>>> hit_test_data;

 private:
  FrameSinkManagerClient_OnAggregatedHitTestRegionListUpdated_Params_Data();
  ~FrameSinkManagerClient_OnAggregatedHitTestRegionListUpdated_Params_Data() = delete;
};
static_assert(sizeof(FrameSinkManagerClient_OnAggregatedHitTestRegionListUpdated_Params_Data) == 24,
              "Bad sizeof(FrameSinkManagerClient_OnAggregatedHitTestRegionListUpdated_Params_Data)");
class  FrameSinkManagerClient_OnFrameTokenChanged_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(FrameSinkManagerClient_OnFrameTokenChanged_Params_Data));
      new (data()) FrameSinkManagerClient_OnFrameTokenChanged_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    FrameSinkManagerClient_OnFrameTokenChanged_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<FrameSinkManagerClient_OnFrameTokenChanged_Params_Data>(index_);
    }
    FrameSinkManagerClient_OnFrameTokenChanged_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::viz::mojom::internal::FrameSinkId_Data> frame_sink_id;
  uint32_t frame_token;
  uint8_t padfinal_[4];

 private:
  FrameSinkManagerClient_OnFrameTokenChanged_Params_Data();
  ~FrameSinkManagerClient_OnFrameTokenChanged_Params_Data() = delete;
};
static_assert(sizeof(FrameSinkManagerClient_OnFrameTokenChanged_Params_Data) == 24,
              "Bad sizeof(FrameSinkManagerClient_OnFrameTokenChanged_Params_Data)");

}  // namespace internal
class FrameSinkManager_RegisterFrameSinkId_ParamsDataView {
 public:
  FrameSinkManager_RegisterFrameSinkId_ParamsDataView() {}

  FrameSinkManager_RegisterFrameSinkId_ParamsDataView(
      internal::FrameSinkManager_RegisterFrameSinkId_Params_Data* data,
      mojo::internal::SerializationContext* context)
      : data_(data), context_(context) {}

  bool is_null() const { return !data_; }
  inline void GetFrameSinkIdDataView(
      ::viz::mojom::FrameSinkIdDataView* output);

  template <typename UserType>
  WARN_UNUSED_RESULT bool ReadFrameSinkId(UserType* output) {
    auto* pointer = data_->frame_sink_id.Get();
    return mojo::internal::Deserialize<::viz::mojom::FrameSinkIdDataView>(
        pointer, output, context_);
  }
  bool report_activation() const {
    return data_->report_activation;
