// device/vr/public/mojom/vr_service.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors. All rights reserved.
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef DEVICE_VR_PUBLIC_MOJOM_VR_SERVICE_MOJOM_PARAMS_DATA_H_
#define DEVICE_VR_PUBLIC_MOJOM_VR_SERVICE_MOJOM_PARAMS_DATA_H_

#include "base/logging.h"
#include "base/macros.h"
#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"
#include "mojo/public/cpp/bindings/lib/validation_context.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#elif defined(_MSC_VER)
#pragma warning(push)
#pragma warning(disable:4056)
#pragma warning(disable:4065)
#pragma warning(disable:4756)
#endif
namespace device {
namespace mojom {
namespace internal {
class COMPONENT_EXPORT(DEVICE_VR_MOJO_BINDINGS_SHARED) VRService_SetClient_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(VRService_SetClient_Params_Data));
      new (data()) VRService_SetClient_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    VRService_SetClient_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<VRService_SetClient_Params_Data>(index_);
    }
    VRService_SetClient_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Interface_Data client;

 private:
  VRService_SetClient_Params_Data();
  ~VRService_SetClient_Params_Data() = delete;
};
static_assert(sizeof(VRService_SetClient_Params_Data) == 16,
              "Bad sizeof(VRService_SetClient_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_MOJO_BINDINGS_SHARED) VRService_RequestSession_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(VRService_RequestSession_Params_Data));
      new (data()) VRService_RequestSession_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    VRService_RequestSession_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<VRService_RequestSession_Params_Data>(index_);
    }
    VRService_RequestSession_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::XRSessionOptions_Data> options;

 private:
  VRService_RequestSession_Params_Data();
  ~VRService_RequestSession_Params_Data() = delete;
};
static_assert(sizeof(VRService_RequestSession_Params_Data) == 16,
              "Bad sizeof(VRService_RequestSession_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_MOJO_BINDINGS_SHARED) VRService_RequestSession_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(VRService_RequestSession_ResponseParams_Data));
      new (data()) VRService_RequestSession_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    VRService_RequestSession_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<VRService_RequestSession_ResponseParams_Data>(index_);
    }
    VRService_RequestSession_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  internal::RequestSessionResult_Data result;

 private:
  VRService_RequestSession_ResponseParams_Data();
  ~VRService_RequestSession_ResponseParams_Data() = delete;
};
static_assert(sizeof(VRService_RequestSession_ResponseParams_Data) == 24,
              "Bad sizeof(VRService_RequestSession_ResponseParams_Data)");
class COMPONENT_EXPORT(DEVICE_VR_MOJO_BINDINGS_SHARED) VRService_SupportsSession_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(VRService_SupportsSession_Params_Data));
      new (data()) VRService_SupportsSession_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    VRService_SupportsSession_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<VRService_SupportsSession_Params_Data>(index_);
    }
    VRService_SupportsSession_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::XRSessionOptions_Data> options;

 private:
  VRService_SupportsSession_Params_Data();
  ~VRService_SupportsSession_Params_Data() = delete;
};
static_assert(sizeof(VRService_SupportsSession_Params_Data) == 16,
              "Bad sizeof(VRService_SupportsSession_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_MOJO_BINDINGS_SHARED) VRService_SupportsSession_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(VRService_SupportsSession_ResponseParams_Data));
      new (data()) VRService_SupportsSession_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    VRService_SupportsSession_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<VRService_SupportsSession_ResponseParams_Data>(index_);
    }
    VRService_SupportsSession_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t supports_session : 1;
  uint8_t padfinal_[7];

 private:
  VRService_SupportsSession_ResponseParams_Data();
  ~VRService_SupportsSession_ResponseParams_Data() = delete;
};
static_assert(sizeof(VRService_SupportsSession_ResponseParams_Data) == 16,
              "Bad sizeof(VRService_SupportsSession_ResponseParams_Data)");
class COMPONENT_EXPORT(DEVICE_VR_MOJO_BINDINGS_SHARED) VRService_ExitPresent_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(VRService_ExitPresent_Params_Data));
      new (data()) VRService_ExitPresent_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    VRService_ExitPresent_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<VRService_ExitPresent_Params_Data>(index_);
    }
    VRService_ExitPresent_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  VRService_ExitPresent_Params_Data();
  ~VRService_ExitPresent_Params_Data() = delete;
};
static_assert(sizeof(VRService_ExitPresent_Params_Data) == 8,
              "Bad sizeof(VRService_ExitPresent_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_MOJO_BINDINGS_SHARED) VRService_ExitPresent_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(VRService_ExitPresent_ResponseParams_Data));
      new (data()) VRService_ExitPresent_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    VRService_ExitPresent_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<VRService_ExitPresent_ResponseParams_Data>(index_);
    }
    VRService_ExitPresent_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  VRService_ExitPresent_ResponseParams_Data();
  ~VRService_ExitPresent_ResponseParams_Data() = delete;
};
static_assert(sizeof(VRService_ExitPresent_ResponseParams_Data) == 8,
              "Bad sizeof(VRService_ExitPresent_ResponseParams_Data)");
class COMPONENT_EXPORT(DEVICE_VR_MOJO_BINDINGS_SHARED) VRService_SetFramesThrottled_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(VRService_SetFramesThrottled_Params_Data));
      new (data()) VRService_SetFramesThrottled_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    VRService_SetFramesThrottled_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<VRService_SetFramesThrottled_Params_Data>(index_);
    }
    VRService_SetFramesThrottled_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t throttled : 1;
  uint8_t padfinal_[7];

 private:
  VRService_SetFramesThrottled_Params_Data();
  ~VRService_SetFramesThrottled_Params_Data() = delete;
};
static_assert(sizeof(VRService_SetFramesThrottled_Params_Data) == 16,
              "Bad sizeof(VRService_SetFramesThrottled_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_MOJO_BINDINGS_SHARED) XRSessionMetricsRecorder_ReportFeatureUsed_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(XRSessionMetricsRecorder_ReportFeatureUsed_Params_Data));
      new (data()) XRSessionMetricsRecorder_ReportFeatureUsed_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    XRSessionMetricsRecorder_ReportFeatureUsed_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<XRSessionMetricsRecorder_ReportFeatureUsed_Params_Data>(index_);
    }
    XRSessionMetricsRecorder_ReportFeatureUsed_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t feature;
  uint8_t padfinal_[4];

 private:
  XRSessionMetricsRecorder_ReportFeatureUsed_Params_Data();
  ~XRSessionMetricsRecorder_ReportFeatureUsed_Params_Data() = delete;
};
static_assert(sizeof(XRSessionMetricsRecorder_ReportFeatureUsed_Params_Data) == 16,
              "Bad sizeof(XRSessionMetricsRecorder_ReportFeatureUsed_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_MOJO_BINDINGS_SHARED) VRServiceClient_OnDeviceChanged_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(VRServiceClient_OnDeviceChanged_Params_Data));
      new (data()) VRServiceClient_OnDeviceChanged_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    VRServiceClient_OnDeviceChanged_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<VRServiceClient_OnDeviceChanged_Params_Data>(index_);
    }
    VRServiceClient_OnDeviceChanged_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  VRServiceClient_OnDeviceChanged_Params_Data();
  ~VRServiceClient_OnDeviceChanged_Params_Data() = delete;
};
static_assert(sizeof(VRServiceClient_OnDeviceChanged_Params_Data) == 8,
              "Bad sizeof(VRServiceClient_OnDeviceChanged_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_MOJO_BINDINGS_SHARED) XREnvironmentIntegrationProvider_RequestHitTest_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(XREnvironmentIntegrationProvider_RequestHitTest_Params_Data));
      new (data()) XREnvironmentIntegrationProvider_RequestHitTest_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    XREnvironmentIntegrationProvider_RequestHitTest_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<XREnvironmentIntegrationProvider_RequestHitTest_Params_Data>(index_);
    }
    XREnvironmentIntegrationProvider_RequestHitTest_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::XRRay_Data> ray;

 private:
  XREnvironmentIntegrationProvider_RequestHitTest_Params_Data();
  ~XREnvironmentIntegrationProvider_RequestHitTest_Params_Data() = delete;
};
static_assert(sizeof(XREnvironmentIntegrationProvider_RequestHitTest_Params_Data) == 16,
              "Bad sizeof(XREnvironmentIntegrationProvider_RequestHitTest_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_MOJO_BINDINGS_SHARED) XREnvironmentIntegrationProvider_RequestHitTest_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(XREnvironmentIntegrationProvider_RequestHitTest_ResponseParams_Data));
      new (data()) XREnvironmentIntegrationProvider_RequestHitTest_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    XREnvironmentIntegrationProvider_RequestHitTest_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<XREnvironmentIntegrationProvider_RequestHitTest_ResponseParams_Data>(index_);
    }
    XREnvironmentIntegrationProvider_RequestHitTest_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::XRHitResult_Data>>> results;

 private:
  XREnvironmentIntegrationProvider_RequestHitTest_ResponseParams_Data();
  ~XREnvironmentIntegrationProvider_RequestHitTest_ResponseParams_Data() = delete;
};
static_assert(sizeof(XREnvironmentIntegrationProvider_RequestHitTest_ResponseParams_Data) == 16,
              "Bad sizeof(XREnvironmentIntegrationProvider_RequestHitTest_ResponseParams_Data)");
class COMPONENT_EXPORT(DEVICE_VR_MOJO_BINDINGS_SHARED) XREnvironmentIntegrationProvider_SubscribeToHitTest_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(XREnvironmentIntegrationProvider_SubscribeToHitTest_Params_Data));
      new (data()) XREnvironmentIntegrationProvider_SubscribeToHitTest_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    XREnvironmentIntegrationProvider_SubscribeToHitTest_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<XREnvironmentIntegrationProvider_SubscribeToHitTest_Params_Data>(index_);
    }
    XREnvironmentIntegrationProvider_SubscribeToHitTest_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  internal::XRNativeOriginInformation_Data native_origin_information;
  mojo::internal::Pointer<mojo::internal::Array_Data<int32_t>> entity_types;
  mojo::internal::Pointer<internal::XRRay_Data> ray;

 private:
  XREnvironmentIntegrationProvider_SubscribeToHitTest_Params_Data();
  ~XREnvironmentIntegrationProvider_SubscribeToHitTest_Params_Data() = delete;
};
static_assert(sizeof(XREnvironmentIntegrationProvider_SubscribeToHitTest_Params_Data) == 40,
              "Bad sizeof(XREnvironmentIntegrationProvider_SubscribeToHitTest_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_MOJO_BINDINGS_SHARED) XREnvironmentIntegrationProvider_SubscribeToHitTest_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(XREnvironmentIntegrationProvider_SubscribeToHitTest_ResponseParams_Data));
      new (data()) XREnvironmentIntegrationProvider_SubscribeToHitTest_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    XREnvironmentIntegrationProvider_SubscribeToHitTest_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<XREnvironmentIntegrationProvider_SubscribeToHitTest_ResponseParams_Data>(index_);
    }
    XREnvironmentIntegrationProvider_SubscribeToHitTest_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t result;
  uint8_t pad0_[4];
  uint64_t subscription_id;

 private:
  XREnvironmentIntegrationProvider_SubscribeToHitTest_ResponseParams_Data();
  ~XREnvironmentIntegrationProvider_SubscribeToHitTest_ResponseParams_Data() = delete;
};
static_assert(sizeof(XREnvironmentIntegrationProvider_SubscribeToHitTest_ResponseParams_Data) == 24,
              "Bad sizeof(XREnvironmentIntegrationProvider_SubscribeToHitTest_ResponseParams_Data)");
class COMPONENT_EXPORT(DEVICE_VR_MOJO_BINDINGS_SHARED) XREnvironmentIntegrationProvider_SubscribeToHitTestForTransientInput_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(XREnvironmentIntegrationProvider_SubscribeToHitTestForTransientInput_Params_Data));
      new (data()) XREnvironmentIntegrationProvider_SubscribeToHitTestForTransientInput_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    XREnvironmentIntegrationProvider_SubscribeToHitTestForTransientInput_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<XREnvironmentIntegrationProvider_SubscribeToHitTestForTransientInput_Params_Data>(index_);
    }
    XREnvironmentIntegrationProvider_SubscribeToHitTestForTransientInput_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::String_Data> profile_name;
  mojo::internal::Pointer<mojo::internal::Array_Data<int32_t>> entity_types;
  mojo::internal::Pointer<internal::XRRay_Data> ray;

 private:
  XREnvironmentIntegrationProvider_SubscribeToHitTestForTransientInput_Params_Data();
  ~XREnvironmentIntegrationProvider_SubscribeToHitTestForTransientInput_Params_Data() = delete;
};
static_assert(sizeof(XREnvironmentIntegrationProvider_SubscribeToHitTestForTransientInput_Params_Data) == 32,
              "Bad sizeof(XREnvironmentIntegrationProvider_SubscribeToHitTestForTransientInput_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_MOJO_BINDINGS_SHARED) XREnvironmentIntegrationProvider_SubscribeToHitTestForTransientInput_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(XREnvironmentIntegrationProvider_SubscribeToHitTestForTransientInput_ResponseParams_Data));
      new (data()) XREnvironmentIntegrationProvider_SubscribeToHitTestForTransientInput_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    XREnvironmentIntegrationProvider_SubscribeToHitTestForTransientInput_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<XREnvironmentIntegrationProvider_SubscribeToHitTestForTransientInput_ResponseParams_Data>(index_);
    }
    XREnvironmentIntegrationProvider_SubscribeToHitTestForTransientInput_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t result;
  uint8_t pad0_[4];
  uint64_t subscription_id;

 private:
  XREnvironmentIntegrationProvider_SubscribeToHitTestForTransientInput_ResponseParams_Data();
  ~XREnvironmentIntegrationProvider_SubscribeToHitTestForTransientInput_ResponseParams_Data() = delete;
};
static_assert(sizeof(XREnvironmentIntegrationProvider_SubscribeToHitTestForTransientInput_ResponseParams_Data) == 24,
              "Bad sizeof(XREnvironmentIntegrationProvider_SubscribeToHitTestForTransientInput_ResponseParams_Data)");
class COMPONENT_EXPORT(DEVICE_VR_MOJO_BINDINGS_SHARED) XREnvironmentIntegrationProvider_UnsubscribeFromHitTest_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(XREnvironmentIntegrationProvider_UnsubscribeFromHitTest_Params_Data));
      new (data()) XREnvironmentIntegrationProvider_UnsubscribeFromHitTest_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    XREnvironmentIntegrationProvider_UnsubscribeFromHitTest_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<XREnvironmentIntegrationProvider_UnsubscribeFromHitTest_Params_Data>(index_);
    }
    XREnvironmentIntegrationProvider_UnsubscribeFromHitTest_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint64_t subscription_id;

 private:
  XREnvironmentIntegrationProvider_UnsubscribeFromHitTest_Params_Data();
  ~XREnvironmentIntegrationProvider_UnsubscribeFromHitTest_Params_Data() = delete;
};
static_assert(sizeof(XREnvironmentIntegrationProvider_UnsubscribeFromHitTest_Params_Data) == 16,
              "Bad sizeof(XREnvironmentIntegrationProvider_UnsubscribeFromHitTest_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_MOJO_BINDINGS_SHARED) XREnvironmentIntegrationProvider_CreateAnchor_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(XREnvironmentIntegrationProvider_CreateAnchor_Params_Data));
      new (data()) XREnvironmentIntegrationProvider_CreateAnchor_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    XREnvironmentIntegrationProvider_CreateAnchor_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<XREnvironmentIntegrationProvider_CreateAnchor_Params_Data>(index_);
    }
    XREnvironmentIntegrationProvider_CreateAnchor_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::Pose_Data> anchor_pose;

 private:
  XREnvironmentIntegrationProvider_CreateAnchor_Params_Data();
  ~XREnvironmentIntegrationProvider_CreateAnchor_Params_Data() = delete;
};
static_assert(sizeof(XREnvironmentIntegrationProvider_CreateAnchor_Params_Data) == 16,
              "Bad sizeof(XREnvironmentIntegrationProvider_CreateAnchor_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_MOJO_BINDINGS_SHARED) XREnvironmentIntegrationProvider_CreateAnchor_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(XREnvironmentIntegrationProvider_CreateAnchor_ResponseParams_Data));
      new (data()) XREnvironmentIntegrationProvider_CreateAnchor_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    XREnvironmentIntegrationProvider_CreateAnchor_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<XREnvironmentIntegrationProvider_CreateAnchor_ResponseParams_Data>(index_);
    }
    XREnvironmentIntegrationProvider_CreateAnchor_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t result;
  uint8_t pad0_[4];
  uint64_t anchor_id;

 private:
  XREnvironmentIntegrationProvider_CreateAnchor_ResponseParams_Data();
  ~XREnvironmentIntegrationProvider_CreateAnchor_ResponseParams_Data() = delete;
};
static_assert(sizeof(XREnvironmentIntegrationProvider_CreateAnchor_ResponseParams_Data) == 24,
              "Bad sizeof(XREnvironmentIntegrationProvider_CreateAnchor_ResponseParams_Data)");
class COMPONENT_EXPORT(DEVICE_VR_MOJO_BINDINGS_SHARED) XREnvironmentIntegrationProvider_CreatePlaneAnchor_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(XREnvironmentIntegrationProvider_CreatePlaneAnchor_Params_Data));
      new (data()) XREnvironmentIntegrationProvider_CreatePlaneAnchor_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    XREnvironmentIntegrationProvider_CreatePlaneAnchor_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<XREnvironmentIntegrationProvider_CreatePlaneAnchor_Params_Data>(index_);
    }
    XREnvironmentIntegrationProvider_CreatePlaneAnchor_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::Pose_Data> anchor_pose;
  uint64_t plane_id;

 private:
  XREnvironmentIntegrationProvider_CreatePlaneAnchor_Params_Data();
  ~XREnvironmentIntegrationProvider_CreatePlaneAnchor_Params_Data() = delete;
};
static_assert(sizeof(XREnvironmentIntegrationProvider_CreatePlaneAnchor_Params_Data) == 24,
              "Bad sizeof(XREnvironmentIntegrationProvider_CreatePlaneAnchor_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_MOJO_BINDINGS_SHARED) XREnvironmentIntegrationProvider_CreatePlaneAnchor_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(XREnvironmentIntegrationProvider_CreatePlaneAnchor_ResponseParams_Data));
      new (data()) XREnvironmentIntegrationProvider_CreatePlaneAnchor_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    XREnvironmentIntegrationProvider_CreatePlaneAnchor_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<XREnvironmentIntegrationProvider_CreatePlaneAnchor_ResponseParams_Data>(index_);
    }
    XREnvironmentIntegrationProvider_CreatePlaneAnchor_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t result;
  uint8_t pad0_[4];
  uint64_t anchor_id;

 private:
  XREnvironmentIntegrationProvider_CreatePlaneAnchor_ResponseParams_Data();
  ~XREnvironmentIntegrationProvider_CreatePlaneAnchor_ResponseParams_Data() = delete;
};
static_assert(sizeof(XREnvironmentIntegrationProvider_CreatePlaneAnchor_ResponseParams_Data) == 24,
              "Bad sizeof(XREnvironmentIntegrationProvider_CreatePlaneAnchor_ResponseParams_Data)");
class COMPONENT_EXPORT(DEVICE_VR_MOJO_BINDINGS_SHARED) XREnvironmentIntegrationProvider_DetachAnchor_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(XREnvironmentIntegrationProvider_DetachAnchor_Params_Data));
      new (data()) XREnvironmentIntegrationProvider_DetachAnchor_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    XREnvironmentIntegrationProvider_DetachAnchor_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<XREnvironmentIntegrationProvider_DetachAnchor_Params_Data>(index_);
    }
    XREnvironmentIntegrationProvider_DetachAnchor_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint64_t anchor_id;

 private:
  XREnvironmentIntegrationProvider_DetachAnchor_Params_Data();
  ~XREnvironmentIntegrationProvider_DetachAnchor_Params_Data() = delete;
};
static_assert(sizeof(XREnvironmentIntegrationProvider_DetachAnchor_Params_Data) == 16,
              "Bad sizeof(XREnvironmentIntegrationProvider_DetachAnchor_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_MOJO_BINDINGS_SHARED) XRInputSourceButtonListener_OnButtonEvent_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(XRInputSourceButtonListener_OnButtonEvent_Params_Data));
      new (data()) XRInputSourceButtonListener_OnButtonEvent_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    XRInputSourceButtonListener_OnButtonEvent_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<XRInputSourceButtonListener_OnButtonEvent_Params_Data>(index_);
    }
    XRInputSourceButtonListener_OnButtonEvent_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::XRInputSourceState_Data> input_source;

 private:
  XRInputSourceButtonListener_OnButtonEvent_Params_Data();
  ~XRInputSourceButtonListener_OnButtonEvent_Params_Data() = delete;
};
static_assert(sizeof(XRInputSourceButtonListener_OnButtonEvent_Params_Data) == 16,
              "Bad sizeof(XRInputSourceButtonListener_OnButtonEvent_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_MOJO_BINDINGS_SHARED) XRFrameDataProvider_GetFrameData_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(XRFrameDataProvider_GetFrameData_Params_Data));
      new (data()) XRFrameDataProvider_GetFrameData_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    XRFrameDataProvider_GetFrameData_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<XRFrameDataProvider_GetFrameData_Params_Data>(index_);
    }
    XRFrameDataProvider_GetFrameData_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::XRFrameDataRequestOptions_Data> options;

 private:
  XRFrameDataProvider_GetFrameData_Params_Data();
  ~XRFrameDataProvider_GetFrameData_Params_Data() = delete;
};
static_assert(sizeof(XRFrameDataProvider_GetFrameData_Params_Data) == 16,
              "Bad sizeof(XRFrameDataProvider_GetFrameData_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_MOJO_BINDINGS_SHARED) XRFrameDataProvider_GetFrameData_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(XRFrameDataProvider_GetFrameData_ResponseParams_Data));
      new (data()) XRFrameDataProvider_GetFrameData_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    XRFrameDataProvider_GetFrameData_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<XRFrameDataProvider_GetFrameData_ResponseParams_Data>(index_);
    }
    XRFrameDataProvider_GetFrameData_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::XRFrameData_Data> frame_data;

 private:
  XRFrameDataProvider_GetFrameData_ResponseParams_Data();
  ~XRFrameDataProvider_GetFrameData_ResponseParams_Data() = delete;
};
static_assert(sizeof(XRFrameDataProvider_GetFrameData_ResponseParams_Data) == 16,
              "Bad sizeof(XRFrameDataProvider_GetFrameData_ResponseParams_Data)");
class COMPONENT_EXPORT(DEVICE_VR_MOJO_BINDINGS_SHARED) XRFrameDataProvider_GetEnvironmentIntegrationProvider_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(XRFrameDataProvider_GetEnvironmentIntegrationProvider_Params_Data));
      new (data()) XRFrameDataProvider_GetEnvironmentIntegrationProvider_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    XRFrameDataProvider_GetEnvironmentIntegrationProvider_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<XRFrameDataProvider_GetEnvironmentIntegrationProvider_Params_Data>(index_);
    }
    XRFrameDataProvider_GetEnvironmentIntegrationProvider_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::AssociatedEndpointHandle_Data environment_provider;
  uint8_t padfinal_[4];

 private:
  XRFrameDataProvider_GetEnvironmentIntegrationProvider_Params_Data();
  ~XRFrameDataProvider_GetEnvironmentIntegrationProvider_Params_Data() = delete;
};
static_assert(sizeof(XRFrameDataProvider_GetEnvironmentIntegrationProvider_Params_Data) == 16,
              "Bad sizeof(XRFrameDataProvider_GetEnvironmentIntegrationProvider_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_MOJO_BINDINGS_SHARED) XRFrameDataProvider_SetInputSourceButtonListener_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(XRFrameDataProvider_SetInputSourceButtonListener_Params_Data));
      new (data()) XRFrameDataProvider_SetInputSourceButtonListener_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    XRFrameDataProvider_SetInputSourceButtonListener_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<XRFrameDataProvider_SetInputSourceButtonListener_Params_Data>(index_);
    }
    XRFrameDataProvider_SetInputSourceButtonListener_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::AssociatedInterface_Data event_listener;

 private:
  XRFrameDataProvider_SetInputSourceButtonListener_Params_Data();
  ~XRFrameDataProvider_SetInputSourceButtonListener_Params_Data() = delete;
};
static_assert(sizeof(XRFrameDataProvider_SetInputSourceButtonListener_Params_Data) == 16,
              "Bad sizeof(XRFrameDataProvider_SetInputSourceButtonListener_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_MOJO_BINDINGS_SHARED) XRPresentationProvider_UpdateLayerBounds_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(XRPresentationProvider_UpdateLayerBounds_Params_Data));
      new (data()) XRPresentationProvider_UpdateLayerBounds_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    XRPresentationProvider_UpdateLayerBounds_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<XRPresentationProvider_UpdateLayerBounds_Params_Data>(index_);
    }
    XRPresentationProvider_UpdateLayerBounds_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int16_t frame_id;
  uint8_t pad0_[6];
  mojo::internal::Pointer<::gfx::mojom::internal::RectF_Data> left_bounds;
  mojo::internal::Pointer<::gfx::mojom::internal::RectF_Data> right_bounds;
  mojo::internal::Pointer<::gfx::mojom::internal::Size_Data> source_size;

 private:
  XRPresentationProvider_UpdateLayerBounds_Params_Data();
  ~XRPresentationProvider_UpdateLayerBounds_Params_Data() = delete;
};
static_assert(sizeof(XRPresentationProvider_UpdateLayerBounds_Params_Data) == 40,
              "Bad sizeof(XRPresentationProvider_UpdateLayerBounds_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_MOJO_BINDINGS_SHARED) XRPresentationProvider_SubmitFrameMissing_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(XRPresentationProvider_SubmitFrameMissing_Params_Data));
      new (data()) XRPresentationProvider_SubmitFrameMissing_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    XRPresentationProvider_SubmitFrameMissing_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<XRPresentationProvider_SubmitFrameMissing_Params_Data>(index_);
    }
    XRPresentationProvider_SubmitFrameMissing_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int16_t frame_id;
  uint8_t pad0_[6];
  mojo::internal::Pointer<::gpu::mojom::internal::SyncToken_Data> sync_token;

 private:
  XRPresentationProvider_SubmitFrameMissing_Params_Data();
  ~XRPresentationProvider_SubmitFrameMissing_Params_Data() = delete;
};
static_assert(sizeof(XRPresentationProvider_SubmitFrameMissing_Params_Data) == 24,
              "Bad sizeof(XRPresentationProvider_SubmitFrameMissing_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_MOJO_BINDINGS_SHARED) XRPresentationProvider_SubmitFrame_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(XRPresentationProvider_SubmitFrame_Params_Data));
      new (data()) XRPresentationProvider_SubmitFrame_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    XRPresentationProvider_SubmitFrame_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<XRPresentationProvider_SubmitFrame_Params_Data>(index_);
    }
    XRPresentationProvider_SubmitFrame_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int16_t frame_id;
  uint8_t pad0_[6];
  mojo::internal::Pointer<::gpu::mojom::internal::MailboxHolder_Data> mailbox_holder;
  mojo::internal::Pointer<::mojo_base::mojom::internal::TimeDelta_Data> time_waited;

 private:
  XRPresentationProvider_SubmitFrame_Params_Data();
  ~XRPresentationProvider_SubmitFrame_Params_Data() = delete;
};
static_assert(sizeof(XRPresentationProvider_SubmitFrame_Params_Data) == 32,
              "Bad sizeof(XRPresentationProvider_SubmitFrame_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_MOJO_BINDINGS_SHARED) XRPresentationProvider_SubmitFrameWithTextureHandle_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(XRPresentationProvider_SubmitFrameWithTextureHandle_Params_Data));
      new (data()) XRPresentationProvider_SubmitFrameWithTextureHandle_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    XRPresentationProvider_SubmitFrameWithTextureHandle_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<XRPresentationProvider_SubmitFrameWithTextureHandle_Params_Data>(index_);
    }
    XRPresentationProvider_SubmitFrameWithTextureHandle_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int16_t frameId;
  uint8_t pad0_[2];
  mojo::internal::Handle_Data texture;

 private:
  XRPresentationProvider_SubmitFrameWithTextureHandle_Params_Data();
  ~XRPresentationProvider_SubmitFrameWithTextureHandle_Params_Data() = delete;
};
static_assert(sizeof(XRPresentationProvider_SubmitFrameWithTextureHandle_Params_Data) == 16,
              "Bad sizeof(XRPresentationProvider_SubmitFrameWithTextureHandle_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_MOJO_BINDINGS_SHARED) XRPresentationProvider_SubmitFrameDrawnIntoTexture_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(XRPresentationProvider_SubmitFrameDrawnIntoTexture_Params_Data));
      new (data()) XRPresentationProvider_SubmitFrameDrawnIntoTexture_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    XRPresentationProvider_SubmitFrameDrawnIntoTexture_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<XRPresentationProvider_SubmitFrameDrawnIntoTexture_Params_Data>(index_);
    }
    XRPresentationProvider_SubmitFrameDrawnIntoTexture_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int16_t frameId;
  uint8_t pad0_[6];
  mojo::internal::Pointer<::gpu::mojom::internal::SyncToken_Data> sync_token;
  mojo::internal::Pointer<::mojo_base::mojom::internal::TimeDelta_Data> time_waited;

 private:
  XRPresentationProvider_SubmitFrameDrawnIntoTexture_Params_Data();
  ~XRPresentationProvider_SubmitFrameDrawnIntoTexture_Params_Data() = delete;
};
static_assert(sizeof(XRPresentationProvider_SubmitFrameDrawnIntoTexture_Params_Data) == 32,
              "Bad sizeof(XRPresentationProvider_SubmitFrameDrawnIntoTexture_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_MOJO_BINDINGS_SHARED) XRPresentationClient_OnSubmitFrameTransferred_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(XRPresentationClient_OnSubmitFrameTransferred_Params_Data));
      new (data()) XRPresentationClient_OnSubmitFrameTransferred_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    XRPresentationClient_OnSubmitFrameTransferred_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<XRPresentationClient_OnSubmitFrameTransferred_Params_Data>(index_);
    }
    XRPresentationClient_OnSubmitFrameTransferred_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t success : 1;
  uint8_t padfinal_[7];

 private:
  XRPresentationClient_OnSubmitFrameTransferred_Params_Data();
  ~XRPresentationClient_OnSubmitFrameTransferred_Params_Data() = delete;
};
static_assert(sizeof(XRPresentationClient_OnSubmitFrameTransferred_Params_Data) == 16,
              "Bad sizeof(XRPresentationClient_OnSubmitFrameTransferred_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_MOJO_BINDINGS_SHARED) XRPresentationClient_OnSubmitFrameRendered_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(XRPresentationClient_OnSubmitFrameRendered_Params_Data));
      new (data()) XRPresentationClient_OnSubmitFrameRendered_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    XRPresentationClient_OnSubmitFrameRendered_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<XRPresentationClient_OnSubmitFrameRendered_Params_Data>(index_);
    }
    XRPresentationClient_OnSubmitFrameRendered_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  XRPresentationClient_OnSubmitFrameRendered_Params_Data();
  ~XRPresentationClient_OnSubmitFrameRendered_Params_Data() = delete;
};
static_assert(sizeof(XRPresentationClient_OnSubmitFrameRendered_Params_Data) == 8,
              "Bad sizeof(XRPresentationClient_OnSubmitFrameRendered_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_MOJO_BINDINGS_SHARED) XRPresentationClient_OnSubmitFrameGpuFence_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(XRPresentationClient_OnSubmitFrameGpuFence_Params_Data));
      new (data()) XRPresentationClient_OnSubmitFrameGpuFence_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    XRPresentationClient_OnSubmitFrameGpuFence_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<XRPresentationClient_OnSubmitFrameGpuFence_Params_Data>(index_);
    }
    XRPresentationClient_OnSubmitFrameGpuFence_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::gfx::mojom::internal::GpuFenceHandle_Data> gpu_fence_handle;

 private:
  XRPresentationClient_OnSubmitFrameGpuFence_Params_Data();
  ~XRPresentationClient_OnSubmitFrameGpuFence_Params_Data() = delete;
};
static_assert(sizeof(XRPresentationClient_OnSubmitFrameGpuFence_Params_Data) == 16,
              "Bad sizeof(XRPresentationClient_OnSubmitFrameGpuFence_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_MOJO_BINDINGS_SHARED) XRSessionClient_OnChanged_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(XRSessionClient_OnChanged_Params_Data));
      new (data()) XRSessionClient_OnChanged_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    XRSessionClient_OnChanged_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<XRSessionClient_OnChanged_Params_Data>(index_);
    }
    XRSessionClient_OnChanged_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::VRDisplayInfo_Data> display;

 private:
  XRSessionClient_OnChanged_Params_Data();
  ~XRSessionClient_OnChanged_Params_Data() = delete;
};
static_assert(sizeof(XRSessionClient_OnChanged_Params_Data) == 16,
              "Bad sizeof(XRSessionClient_OnChanged_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_MOJO_BINDINGS_SHARED) XRSessionClient_OnExitPresent_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(XRSessionClient_OnExitPresent_Params_Data));
      new (data()) XRSessionClient_OnExitPresent_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    XRSessionClient_OnExitPresent_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<XRSessionClient_OnExitPresent_Params_Data>(index_);
    }
    XRSessionClient_OnExitPresent_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;

 private:
  XRSessionClient_OnExitPresent_Params_Data();
  ~XRSessionClient_OnExitPresent_Params_Data() = delete;
};
static_assert(sizeof(XRSessionClient_OnExitPresent_Params_Data) == 8,
              "Bad sizeof(XRSessionClient_OnExitPresent_Params_Data)");
class COMPONENT_EXPORT(DEVICE_VR_MOJO_BINDINGS_SHARED) XRSessionClient_OnVisibilityStateChanged_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(XRSessionClient_OnVisibilityStateChanged_Params_Data));
      new (data()) XRSessionClient_OnVisibilityStateChanged_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    XRSessionClient_OnVisibilityStateChanged_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<XRSessionClient_OnVisibilityStateChanged_Params_Data>(index_);
    }
    XRSessionClient_OnVisibilityStateChanged_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t visibility_state;
  uint8_t padfinal_[4];

 private:
  XRSessionClient_OnVisibilityStateChanged_Params_Data();
  ~XRSessionClient_OnVisibilityStateChanged_Params_Data() = delete;
};
static_assert(sizeof(XRSessionClient_OnVisibilityStateChanged_Params_Data) == 16,
              "Bad sizeof(XRSessionClient_OnVisibilityStateChanged_Params_Data)");

}  // namespace internal
class VRService_SetClient_ParamsDataView {
 public:
  VRService_SetClient_ParamsDataView() {}

  VRService_SetClient_ParamsDataView(
      internal::VRService_SetClient_Params_Data* data,
      mojo::internal::SerializationContext* context)
      : data_(data), context_(context) {}

  bool is_null() const { return !data_; }
  template <typename UserType>
  UserType TakeClient() {
    UserType result;
    bool ret =
        mojo::internal::Deserialize<mojo::InterfacePtrDataView<::device::mojom::VRServiceClientInterfaceBase>>(
            &data_->client, &result, context_);
    DCHECK(ret);
    return result;
  }
 private:
  internal::VRService_SetClient_Params_Data* data_ = nullptr;
  mojo::internal::SerializationContext* context_ = nullptr;
};

class VRService_RequestSession_ParamsDataView {
 public:
