// third_party/blink/public/mojom/background_sync/background_sync.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors. All rights reserved.
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef THIRD_PARTY_BLINK_PUBLIC_MOJOM_BACKGROUND_SYNC_BACKGROUND_SYNC_MOJOM_PARAMS_DATA_H_
#define THIRD_PARTY_BLINK_PUBLIC_MOJOM_BACKGROUND_SYNC_BACKGROUND_SYNC_MOJOM_PARAMS_DATA_H_

#include "base/logging.h"
#include "base/macros.h"
#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"
#include "mojo/public/cpp/bindings/lib/validation_context.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#elif defined(_MSC_VER)
#pragma warning(push)
#pragma warning(disable:4056)
#pragma warning(disable:4065)
#pragma warning(disable:4756)
#endif
namespace blink {
namespace mojom {
namespace internal {
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) OneShotBackgroundSyncService_Register_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(OneShotBackgroundSyncService_Register_Params_Data));
      new (data()) OneShotBackgroundSyncService_Register_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    OneShotBackgroundSyncService_Register_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<OneShotBackgroundSyncService_Register_Params_Data>(index_);
    }
    OneShotBackgroundSyncService_Register_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::SyncRegistrationOptions_Data> options;
  int64_t service_worker_registration_id;

 private:
  OneShotBackgroundSyncService_Register_Params_Data();
  ~OneShotBackgroundSyncService_Register_Params_Data() = delete;
};
static_assert(sizeof(OneShotBackgroundSyncService_Register_Params_Data) == 24,
              "Bad sizeof(OneShotBackgroundSyncService_Register_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) OneShotBackgroundSyncService_Register_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(OneShotBackgroundSyncService_Register_ResponseParams_Data));
      new (data()) OneShotBackgroundSyncService_Register_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    OneShotBackgroundSyncService_Register_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<OneShotBackgroundSyncService_Register_ResponseParams_Data>(index_);
    }
    OneShotBackgroundSyncService_Register_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t err;
  uint8_t pad0_[4];
  mojo::internal::Pointer<internal::SyncRegistrationOptions_Data> options;

 private:
  OneShotBackgroundSyncService_Register_ResponseParams_Data();
  ~OneShotBackgroundSyncService_Register_ResponseParams_Data() = delete;
};
static_assert(sizeof(OneShotBackgroundSyncService_Register_ResponseParams_Data) == 24,
              "Bad sizeof(OneShotBackgroundSyncService_Register_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) OneShotBackgroundSyncService_DidResolveRegistration_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(OneShotBackgroundSyncService_DidResolveRegistration_Params_Data));
      new (data()) OneShotBackgroundSyncService_DidResolveRegistration_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    OneShotBackgroundSyncService_DidResolveRegistration_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<OneShotBackgroundSyncService_DidResolveRegistration_Params_Data>(index_);
    }
    OneShotBackgroundSyncService_DidResolveRegistration_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::BackgroundSyncRegistrationInfo_Data> registration_info;

 private:
  OneShotBackgroundSyncService_DidResolveRegistration_Params_Data();
  ~OneShotBackgroundSyncService_DidResolveRegistration_Params_Data() = delete;
};
static_assert(sizeof(OneShotBackgroundSyncService_DidResolveRegistration_Params_Data) == 16,
              "Bad sizeof(OneShotBackgroundSyncService_DidResolveRegistration_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) OneShotBackgroundSyncService_GetRegistrations_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(OneShotBackgroundSyncService_GetRegistrations_Params_Data));
      new (data()) OneShotBackgroundSyncService_GetRegistrations_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    OneShotBackgroundSyncService_GetRegistrations_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<OneShotBackgroundSyncService_GetRegistrations_Params_Data>(index_);
    }
    OneShotBackgroundSyncService_GetRegistrations_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int64_t service_worker_registration_id;

 private:
  OneShotBackgroundSyncService_GetRegistrations_Params_Data();
  ~OneShotBackgroundSyncService_GetRegistrations_Params_Data() = delete;
};
static_assert(sizeof(OneShotBackgroundSyncService_GetRegistrations_Params_Data) == 16,
              "Bad sizeof(OneShotBackgroundSyncService_GetRegistrations_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) OneShotBackgroundSyncService_GetRegistrations_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(OneShotBackgroundSyncService_GetRegistrations_ResponseParams_Data));
      new (data()) OneShotBackgroundSyncService_GetRegistrations_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    OneShotBackgroundSyncService_GetRegistrations_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<OneShotBackgroundSyncService_GetRegistrations_ResponseParams_Data>(index_);
    }
    OneShotBackgroundSyncService_GetRegistrations_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t err;
  uint8_t pad0_[4];
  mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::SyncRegistrationOptions_Data>>> registrations;

 private:
  OneShotBackgroundSyncService_GetRegistrations_ResponseParams_Data();
  ~OneShotBackgroundSyncService_GetRegistrations_ResponseParams_Data() = delete;
};
static_assert(sizeof(OneShotBackgroundSyncService_GetRegistrations_ResponseParams_Data) == 24,
              "Bad sizeof(OneShotBackgroundSyncService_GetRegistrations_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PeriodicBackgroundSyncService_Register_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(PeriodicBackgroundSyncService_Register_Params_Data));
      new (data()) PeriodicBackgroundSyncService_Register_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    PeriodicBackgroundSyncService_Register_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<PeriodicBackgroundSyncService_Register_Params_Data>(index_);
    }
    PeriodicBackgroundSyncService_Register_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<internal::SyncRegistrationOptions_Data> options;
  int64_t service_worker_registration_id;

 private:
  PeriodicBackgroundSyncService_Register_Params_Data();
  ~PeriodicBackgroundSyncService_Register_Params_Data() = delete;
};
static_assert(sizeof(PeriodicBackgroundSyncService_Register_Params_Data) == 24,
              "Bad sizeof(PeriodicBackgroundSyncService_Register_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PeriodicBackgroundSyncService_Register_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(PeriodicBackgroundSyncService_Register_ResponseParams_Data));
      new (data()) PeriodicBackgroundSyncService_Register_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    PeriodicBackgroundSyncService_Register_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<PeriodicBackgroundSyncService_Register_ResponseParams_Data>(index_);
    }
    PeriodicBackgroundSyncService_Register_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t err;
  uint8_t pad0_[4];
  mojo::internal::Pointer<internal::SyncRegistrationOptions_Data> options;

 private:
  PeriodicBackgroundSyncService_Register_ResponseParams_Data();
  ~PeriodicBackgroundSyncService_Register_ResponseParams_Data() = delete;
};
static_assert(sizeof(PeriodicBackgroundSyncService_Register_ResponseParams_Data) == 24,
              "Bad sizeof(PeriodicBackgroundSyncService_Register_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PeriodicBackgroundSyncService_Unregister_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(PeriodicBackgroundSyncService_Unregister_Params_Data));
      new (data()) PeriodicBackgroundSyncService_Unregister_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    PeriodicBackgroundSyncService_Unregister_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<PeriodicBackgroundSyncService_Unregister_Params_Data>(index_);
    }
    PeriodicBackgroundSyncService_Unregister_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int64_t service_worker_registration_id;
  mojo::internal::Pointer<mojo::internal::String_Data> tag;

 private:
  PeriodicBackgroundSyncService_Unregister_Params_Data();
  ~PeriodicBackgroundSyncService_Unregister_Params_Data() = delete;
};
static_assert(sizeof(PeriodicBackgroundSyncService_Unregister_Params_Data) == 24,
              "Bad sizeof(PeriodicBackgroundSyncService_Unregister_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PeriodicBackgroundSyncService_Unregister_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(PeriodicBackgroundSyncService_Unregister_ResponseParams_Data));
      new (data()) PeriodicBackgroundSyncService_Unregister_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    PeriodicBackgroundSyncService_Unregister_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<PeriodicBackgroundSyncService_Unregister_ResponseParams_Data>(index_);
    }
    PeriodicBackgroundSyncService_Unregister_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t err;
  uint8_t padfinal_[4];

 private:
  PeriodicBackgroundSyncService_Unregister_ResponseParams_Data();
  ~PeriodicBackgroundSyncService_Unregister_ResponseParams_Data() = delete;
};
static_assert(sizeof(PeriodicBackgroundSyncService_Unregister_ResponseParams_Data) == 16,
              "Bad sizeof(PeriodicBackgroundSyncService_Unregister_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PeriodicBackgroundSyncService_GetRegistrations_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(PeriodicBackgroundSyncService_GetRegistrations_Params_Data));
      new (data()) PeriodicBackgroundSyncService_GetRegistrations_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    PeriodicBackgroundSyncService_GetRegistrations_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<PeriodicBackgroundSyncService_GetRegistrations_Params_Data>(index_);
    }
    PeriodicBackgroundSyncService_GetRegistrations_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int64_t service_worker_registration_id;

 private:
  PeriodicBackgroundSyncService_GetRegistrations_Params_Data();
  ~PeriodicBackgroundSyncService_GetRegistrations_Params_Data() = delete;
};
static_assert(sizeof(PeriodicBackgroundSyncService_GetRegistrations_Params_Data) == 16,
              "Bad sizeof(PeriodicBackgroundSyncService_GetRegistrations_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) PeriodicBackgroundSyncService_GetRegistrations_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(PeriodicBackgroundSyncService_GetRegistrations_ResponseParams_Data));
      new (data()) PeriodicBackgroundSyncService_GetRegistrations_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    PeriodicBackgroundSyncService_GetRegistrations_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<PeriodicBackgroundSyncService_GetRegistrations_ResponseParams_Data>(index_);
    }
    PeriodicBackgroundSyncService_GetRegistrations_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t err;
  uint8_t pad0_[4];
  mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::SyncRegistrationOptions_Data>>> registrations;

 private:
  PeriodicBackgroundSyncService_GetRegistrations_ResponseParams_Data();
  ~PeriodicBackgroundSyncService_GetRegistrations_ResponseParams_Data() = delete;
};
static_assert(sizeof(PeriodicBackgroundSyncService_GetRegistrations_ResponseParams_Data) == 24,
              "Bad sizeof(PeriodicBackgroundSyncService_GetRegistrations_ResponseParams_Data)");

}  // namespace internal
class OneShotBackgroundSyncService_Register_ParamsDataView {
 public:
  OneShotBackgroundSyncService_Register_ParamsDataView() {}

  OneShotBackgroundSyncService_Register_ParamsDataView(
      internal::OneShotBackgroundSyncService_Register_Params_Data* data,
      mojo::internal::SerializationContext* context)
      : data_(data), context_(context) {}

  bool is_null() const { return !data_; }
  inline void GetOptionsDataView(
      SyncRegistrationOptionsDataView* output);

  template <typename UserType>
  WARN_UNUSED_RESULT bool ReadOptions(UserType* output) {
    auto* pointer = data_->options.Get();
    return mojo::internal::Deserialize<::blink::mojom::SyncRegistrationOptionsDataView>(
        pointer, output, context_);
  }
