// third_party/blink/public/mojom/native_file_system/native_file_system_directory_handle.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors. All rights reserved.
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef THIRD_PARTY_BLINK_PUBLIC_MOJOM_NATIVE_FILE_SYSTEM_NATIVE_FILE_SYSTEM_DIRECTORY_HANDLE_MOJOM_PARAMS_DATA_H_
#define THIRD_PARTY_BLINK_PUBLIC_MOJOM_NATIVE_FILE_SYSTEM_NATIVE_FILE_SYSTEM_DIRECTORY_HANDLE_MOJOM_PARAMS_DATA_H_

#include "base/logging.h"
#include "base/macros.h"
#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"
#include "mojo/public/cpp/bindings/lib/validation_context.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#elif defined(_MSC_VER)
#pragma warning(push)
#pragma warning(disable:4056)
#pragma warning(disable:4065)
#pragma warning(disable:4756)
#endif
namespace blink {
namespace mojom {
namespace internal {
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) NativeFileSystemDirectoryEntriesListener_DidReadDirectory_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NativeFileSystemDirectoryEntriesListener_DidReadDirectory_Params_Data));
      new (data()) NativeFileSystemDirectoryEntriesListener_DidReadDirectory_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NativeFileSystemDirectoryEntriesListener_DidReadDirectory_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NativeFileSystemDirectoryEntriesListener_DidReadDirectory_Params_Data>(index_);
    }
    NativeFileSystemDirectoryEntriesListener_DidReadDirectory_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::blink::mojom::internal::NativeFileSystemError_Data> result;
  mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::NativeFileSystemEntry_Data>>> entries;
  uint8_t has_more_entries : 1;
  uint8_t padfinal_[7];

 private:
  NativeFileSystemDirectoryEntriesListener_DidReadDirectory_Params_Data();
  ~NativeFileSystemDirectoryEntriesListener_DidReadDirectory_Params_Data() = delete;
};
static_assert(sizeof(NativeFileSystemDirectoryEntriesListener_DidReadDirectory_Params_Data) == 32,
              "Bad sizeof(NativeFileSystemDirectoryEntriesListener_DidReadDirectory_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) NativeFileSystemDirectoryHandle_GetPermissionStatus_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NativeFileSystemDirectoryHandle_GetPermissionStatus_Params_Data));
      new (data()) NativeFileSystemDirectoryHandle_GetPermissionStatus_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NativeFileSystemDirectoryHandle_GetPermissionStatus_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NativeFileSystemDirectoryHandle_GetPermissionStatus_Params_Data>(index_);
    }
    NativeFileSystemDirectoryHandle_GetPermissionStatus_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t writable : 1;
  uint8_t padfinal_[7];

 private:
  NativeFileSystemDirectoryHandle_GetPermissionStatus_Params_Data();
  ~NativeFileSystemDirectoryHandle_GetPermissionStatus_Params_Data() = delete;
};
static_assert(sizeof(NativeFileSystemDirectoryHandle_GetPermissionStatus_Params_Data) == 16,
              "Bad sizeof(NativeFileSystemDirectoryHandle_GetPermissionStatus_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) NativeFileSystemDirectoryHandle_GetPermissionStatus_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NativeFileSystemDirectoryHandle_GetPermissionStatus_ResponseParams_Data));
      new (data()) NativeFileSystemDirectoryHandle_GetPermissionStatus_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NativeFileSystemDirectoryHandle_GetPermissionStatus_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NativeFileSystemDirectoryHandle_GetPermissionStatus_ResponseParams_Data>(index_);
    }
    NativeFileSystemDirectoryHandle_GetPermissionStatus_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  int32_t status;
  uint8_t padfinal_[4];

 private:
  NativeFileSystemDirectoryHandle_GetPermissionStatus_ResponseParams_Data();
  ~NativeFileSystemDirectoryHandle_GetPermissionStatus_ResponseParams_Data() = delete;
};
static_assert(sizeof(NativeFileSystemDirectoryHandle_GetPermissionStatus_ResponseParams_Data) == 16,
              "Bad sizeof(NativeFileSystemDirectoryHandle_GetPermissionStatus_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) NativeFileSystemDirectoryHandle_RequestPermission_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NativeFileSystemDirectoryHandle_RequestPermission_Params_Data));
      new (data()) NativeFileSystemDirectoryHandle_RequestPermission_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NativeFileSystemDirectoryHandle_RequestPermission_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NativeFileSystemDirectoryHandle_RequestPermission_Params_Data>(index_);
    }
    NativeFileSystemDirectoryHandle_RequestPermission_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  uint8_t writable : 1;
  uint8_t padfinal_[7];

 private:
  NativeFileSystemDirectoryHandle_RequestPermission_Params_Data();
  ~NativeFileSystemDirectoryHandle_RequestPermission_Params_Data() = delete;
};
static_assert(sizeof(NativeFileSystemDirectoryHandle_RequestPermission_Params_Data) == 16,
              "Bad sizeof(NativeFileSystemDirectoryHandle_RequestPermission_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) NativeFileSystemDirectoryHandle_RequestPermission_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NativeFileSystemDirectoryHandle_RequestPermission_ResponseParams_Data));
      new (data()) NativeFileSystemDirectoryHandle_RequestPermission_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NativeFileSystemDirectoryHandle_RequestPermission_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NativeFileSystemDirectoryHandle_RequestPermission_ResponseParams_Data>(index_);
    }
    NativeFileSystemDirectoryHandle_RequestPermission_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::blink::mojom::internal::NativeFileSystemError_Data> result;
  int32_t status;
  uint8_t padfinal_[4];

 private:
  NativeFileSystemDirectoryHandle_RequestPermission_ResponseParams_Data();
  ~NativeFileSystemDirectoryHandle_RequestPermission_ResponseParams_Data() = delete;
};
static_assert(sizeof(NativeFileSystemDirectoryHandle_RequestPermission_ResponseParams_Data) == 24,
              "Bad sizeof(NativeFileSystemDirectoryHandle_RequestPermission_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) NativeFileSystemDirectoryHandle_GetFile_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NativeFileSystemDirectoryHandle_GetFile_Params_Data));
      new (data()) NativeFileSystemDirectoryHandle_GetFile_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NativeFileSystemDirectoryHandle_GetFile_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NativeFileSystemDirectoryHandle_GetFile_Params_Data>(index_);
    }
    NativeFileSystemDirectoryHandle_GetFile_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::String_Data> basename;
  uint8_t create : 1;
  uint8_t padfinal_[7];

 private:
  NativeFileSystemDirectoryHandle_GetFile_Params_Data();
  ~NativeFileSystemDirectoryHandle_GetFile_Params_Data() = delete;
};
static_assert(sizeof(NativeFileSystemDirectoryHandle_GetFile_Params_Data) == 24,
              "Bad sizeof(NativeFileSystemDirectoryHandle_GetFile_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) NativeFileSystemDirectoryHandle_GetFile_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NativeFileSystemDirectoryHandle_GetFile_ResponseParams_Data));
      new (data()) NativeFileSystemDirectoryHandle_GetFile_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NativeFileSystemDirectoryHandle_GetFile_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NativeFileSystemDirectoryHandle_GetFile_ResponseParams_Data>(index_);
    }
    NativeFileSystemDirectoryHandle_GetFile_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::blink::mojom::internal::NativeFileSystemError_Data> result;
  mojo::internal::Interface_Data file;

 private:
  NativeFileSystemDirectoryHandle_GetFile_ResponseParams_Data();
  ~NativeFileSystemDirectoryHandle_GetFile_ResponseParams_Data() = delete;
};
static_assert(sizeof(NativeFileSystemDirectoryHandle_GetFile_ResponseParams_Data) == 24,
              "Bad sizeof(NativeFileSystemDirectoryHandle_GetFile_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) NativeFileSystemDirectoryHandle_GetDirectory_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NativeFileSystemDirectoryHandle_GetDirectory_Params_Data));
      new (data()) NativeFileSystemDirectoryHandle_GetDirectory_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NativeFileSystemDirectoryHandle_GetDirectory_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NativeFileSystemDirectoryHandle_GetDirectory_Params_Data>(index_);
    }
    NativeFileSystemDirectoryHandle_GetDirectory_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::String_Data> basename;
  uint8_t create : 1;
  uint8_t padfinal_[7];

 private:
  NativeFileSystemDirectoryHandle_GetDirectory_Params_Data();
  ~NativeFileSystemDirectoryHandle_GetDirectory_Params_Data() = delete;
};
static_assert(sizeof(NativeFileSystemDirectoryHandle_GetDirectory_Params_Data) == 24,
              "Bad sizeof(NativeFileSystemDirectoryHandle_GetDirectory_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) NativeFileSystemDirectoryHandle_GetDirectory_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NativeFileSystemDirectoryHandle_GetDirectory_ResponseParams_Data));
      new (data()) NativeFileSystemDirectoryHandle_GetDirectory_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NativeFileSystemDirectoryHandle_GetDirectory_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NativeFileSystemDirectoryHandle_GetDirectory_ResponseParams_Data>(index_);
    }
    NativeFileSystemDirectoryHandle_GetDirectory_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::blink::mojom::internal::NativeFileSystemError_Data> result;
  mojo::internal::Interface_Data directory;

 private:
  NativeFileSystemDirectoryHandle_GetDirectory_ResponseParams_Data();
  ~NativeFileSystemDirectoryHandle_GetDirectory_ResponseParams_Data() = delete;
};
static_assert(sizeof(NativeFileSystemDirectoryHandle_GetDirectory_ResponseParams_Data) == 24,
              "Bad sizeof(NativeFileSystemDirectoryHandle_GetDirectory_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) NativeFileSystemDirectoryHandle_GetEntries_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NativeFileSystemDirectoryHandle_GetEntries_Params_Data));
      new (data()) NativeFileSystemDirectoryHandle_GetEntries_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NativeFileSystemDirectoryHandle_GetEntries_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NativeFileSystemDirectoryHandle_GetEntries_Params_Data>(index_);
    }
    NativeFileSystemDirectoryHandle_GetEntries_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Interface_Data listener;

 private:
  NativeFileSystemDirectoryHandle_GetEntries_Params_Data();
  ~NativeFileSystemDirectoryHandle_GetEntries_Params_Data() = delete;
};
static_assert(sizeof(NativeFileSystemDirectoryHandle_GetEntries_Params_Data) == 16,
              "Bad sizeof(NativeFileSystemDirectoryHandle_GetEntries_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) NativeFileSystemDirectoryHandle_RemoveEntry_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NativeFileSystemDirectoryHandle_RemoveEntry_Params_Data));
      new (data()) NativeFileSystemDirectoryHandle_RemoveEntry_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NativeFileSystemDirectoryHandle_RemoveEntry_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NativeFileSystemDirectoryHandle_RemoveEntry_Params_Data>(index_);
    }
    NativeFileSystemDirectoryHandle_RemoveEntry_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<mojo::internal::String_Data> basename;
  uint8_t recurse : 1;
  uint8_t padfinal_[7];

 private:
  NativeFileSystemDirectoryHandle_RemoveEntry_Params_Data();
  ~NativeFileSystemDirectoryHandle_RemoveEntry_Params_Data() = delete;
};
static_assert(sizeof(NativeFileSystemDirectoryHandle_RemoveEntry_Params_Data) == 24,
              "Bad sizeof(NativeFileSystemDirectoryHandle_RemoveEntry_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) NativeFileSystemDirectoryHandle_RemoveEntry_ResponseParams_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NativeFileSystemDirectoryHandle_RemoveEntry_ResponseParams_Data));
      new (data()) NativeFileSystemDirectoryHandle_RemoveEntry_ResponseParams_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NativeFileSystemDirectoryHandle_RemoveEntry_ResponseParams_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NativeFileSystemDirectoryHandle_RemoveEntry_ResponseParams_Data>(index_);
    }
    NativeFileSystemDirectoryHandle_RemoveEntry_ResponseParams_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Pointer<::blink::mojom::internal::NativeFileSystemError_Data> result;

 private:
  NativeFileSystemDirectoryHandle_RemoveEntry_ResponseParams_Data();
  ~NativeFileSystemDirectoryHandle_RemoveEntry_ResponseParams_Data() = delete;
};
static_assert(sizeof(NativeFileSystemDirectoryHandle_RemoveEntry_ResponseParams_Data) == 16,
              "Bad sizeof(NativeFileSystemDirectoryHandle_RemoveEntry_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) NativeFileSystemDirectoryHandle_Transfer_Params_Data {
 public:
  class BufferWriter {
   public:
    BufferWriter() = default;

    void Allocate(mojo::internal::Buffer* serialization_buffer) {
      serialization_buffer_ = serialization_buffer;
      index_ = serialization_buffer_->Allocate(sizeof(NativeFileSystemDirectoryHandle_Transfer_Params_Data));
      new (data()) NativeFileSystemDirectoryHandle_Transfer_Params_Data();
    }

    bool is_null() const { return !serialization_buffer_; }
    NativeFileSystemDirectoryHandle_Transfer_Params_Data* data() {
      DCHECK(!is_null());
      return serialization_buffer_->Get<NativeFileSystemDirectoryHandle_Transfer_Params_Data>(index_);
    }
    NativeFileSystemDirectoryHandle_Transfer_Params_Data* operator->() { return data(); }

   private:
    mojo::internal::Buffer* serialization_buffer_ = nullptr;
    size_t index_ = 0;

    DISALLOW_COPY_AND_ASSIGN(BufferWriter);
  };

  static bool Validate(const void* data,
                       mojo::internal::ValidationContext* validation_context);

  mojo::internal::StructHeader header_;
  mojo::internal::Handle_Data token;
  uint8_t padfinal_[4];

 private:
  NativeFileSystemDirectoryHandle_Transfer_Params_Data();
  ~NativeFileSystemDirectoryHandle_Transfer_Params_Data() = delete;
};
static_assert(sizeof(NativeFileSystemDirectoryHandle_Transfer_Params_Data) == 16,
              "Bad sizeof(NativeFileSystemDirectoryHandle_Transfer_Params_Data)");

}  // namespace internal
class NativeFileSystemDirectoryEntriesListener_DidReadDirectory_ParamsDataView {
 public:
  NativeFileSystemDirectoryEntriesListener_DidReadDirectory_ParamsDataView() {}

  NativeFileSystemDirectoryEntriesListener_DidReadDirectory_ParamsDataView(
      internal::NativeFileSystemDirectoryEntriesListener_DidReadDirectory_Params_Data* data,
      mojo::internal::SerializationContext* context)
      : data_(data), context_(context) {}

  bool is_null() const { return !data_; }
  inline void GetResultDataView(
      ::blink::mojom::NativeFileSystemErrorDataView* output);

  template <typename UserType>
  WARN_UNUSED_RESULT bool ReadResult(UserType* output) {
    auto* pointer = data_->result.Get();
    return mojo::internal::Deserialize<::blink::mojom::NativeFileSystemErrorDataView>(
